<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Cn3D.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.Cn3D</string>
	<key>Input</key>
	<dict>
		<key>BASE_URL</key>
		<string>https://www.ncbi.nlm.nih.gov/Structure/CN3D/cn3dmac.shtml</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;match&gt;ftp://ftp.ncbi.nlm.nih.gov/cn3d/Cn3D-(?P&lt;version&gt;[^-]+)-OSX.zip)</string>
		<key>NAME</key>
		<string>Cn3D</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%BASE_URL%</string>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
	</array>
</dict>
</plist>
