<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Verify recipe for GPGSuite.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.GPGSuite.verify</string>
	<key>Input</key>
	<dict>
		<key>KEYID</key>
		<string>85E38F69046B44C1EC9FB07B76D78F0500D026C4</string>
		<key>NAME</key>
		<string>GPGSuite</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.GPGSuite.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>distribution_file</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
				<key>public_key_id</key>
				<string>%KEYID%</string>
				<key>signature_file</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg.sig</string>
			</dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/GPGSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
