<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release of OpenRefine from Github.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.OpenRefine</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenRefine</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>openrefine-mac-.+\.dmg</string>
				<key>github_repo</key>
				<string>OpenRefine/OpenRefine</string>
                <key>include_prereleases</key>
                <true/>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
                <key>requirement</key>
                <string>identifier "com.google.refine.Refine" and certificate leaf = H"3324785d3f758d78f729a7424a75447b15364f98"</string>
                <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
                <true/>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
