<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release of OpenRefine from Github.

By default, only "stable" releases are included. Set INCLUDE_PRERELEASES
to a non-empty value to include releases on GitHub marked as "pre-releases."</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.OpenRefine</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenRefine</string>
                <key>INCLUDE_PRERELEASES</key>
                <string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>openrefine-mac-.+\.dmg</string>
				<key>github_repo</key>
				<string>OpenRefine/OpenRefine</string>
				<key>include_prereleases</key>
				<string>%INCLUDE_PRERELEASES%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
