<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Amazon Corretto, a no-cost, multiplatform, production-ready distribution of OpenJDK</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.AmazonCorretto</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://corretto.aws/downloads/latest/amazon-corretto-%MAJOR_VERSION%-x64-macos-jdk.pkg</string>
		<key>NAME</key>
		<string>AmazonCorretto</string>
		<key>MAJOR_VERSION</key>
		<string>11</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			 <key>Processor</key>
			 <string>CodeSignatureVerifier</string>
			 <key>Arguments</key>
			 <dict>
					<key>input_path</key>
					<string>%pathname%</string>
					<key>expected_authority_names</key>
					<array>
						 <string>Developer ID Installer: AMZN Mobile LLC (94KV3E626L)</string>
						 <string>Developer ID Certification Authority</string>
						 <string>Apple Root CA</string>
					</array>
			 </dict>
		</dict>
	</array>
</dict>
</plist>
