<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Amazon Corretto, a no-cost, multiplatform, production-ready distribution of OpenJDK</string>
	<key>Identifier</key>
	<string>com.github.n8felton.munki.AmazonCorretto</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>x64</string>
		<key>DOWNLOAD_URL</key>
		<string>https://corretto.aws/downloads/latest/amazon-corretto-%MAJOR_VERSION%-%ARCH%-macos-jdk.pkg</string>
		<key>MAJOR_VERSION</key>
		<string>11</string>
		<key>MUNKI_ARCH</key>
		<string>x86_64</string>
		<key>MUNKI_CATEGORY</key>
		<string>Developer</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>AmazonCorretto%MAJOR_VERSION%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Amazon Corretto is a no-cost, multiplatform, production-ready distribution of the Open Java Development Kit (OpenJDK).</string>
			<key>developer</key>
			<string>Amazon</string>
			<key>display_name</key>
			<string>Amazon Corretto %MAJOR_VERSION%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
				<string>%MUNKI_ARCH%</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.AmazonCorretto</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
