<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of HP's Printer Drivers directly from HP.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.HPPrinterDrivers</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>HPPrinterDrivers</string>
		<key>HP_QUERY_TYPE</key>
		<string>ModelName</string>
		<key>HP_QUERY</key>
		<string>HP Color LaserJet Pro M453-4</string>
		<key>OPERATING_SYSTEM</key>
		<string>macOS 12.0</string>
		<key>PRODUCT_NUMBER</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>product_number</key>
				<string>%PRODUCT_NUMBER%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/HPSoftwareInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: HP Inc. (6HB5Y2QTA3)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
