<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of PAUP as configured in com.github.n8felton.paup.download.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.paup.munki</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.paup.download</string>
	<key>Input</key>
	<dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/PAUP</string>
        <key>NAME</key>
        <string>PAUP</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>PAUP (Phylogenetic Analysis Using Parsimony) is a computational phylogenetics program for inferring evolutionary trees, written by David L. Swofford.</string>
            <key>display_name</key>
            <string>PAUP</string>
            <key>minimum_os_version</key>
            <string>10.5.0</string>
            <key>name</key>
            <string>%NAME%</string>
        </dict>
	</dict>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>		
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%destination_path%/PAUP_dev_icc.app</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
	<key>MinimumVersion</key>
    <string>0.5.0</string>
</dict>
</plist>