<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release of Intel HAXM from Github.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.IntelHAXM</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>IntelHAXM</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>haxm-macosx_.+\.zip</string>
				<key>github_repo</key>
				<string>intel/haxm</string>
				<key>include_prereleases</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/*.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Application: Intel Corporation Apps (Z3L495V9L4)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%found_filename%/*.mpkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
