<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Intel Unite® Client for macOS.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.munki.IntelUnite</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>IntelUnite</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>Intel</string>
			<key>display_name</key>
			<string>Intel Unite</string>
			<key>preuninstall_script</key>
			<string>#!/bin/bash

#If the ACE "Audio Components" driver is installed
if [ -d /Library/Audio/Plug-Ins/HAL/ACE.driver ]
then
	#Remove it
	/Applications/Intel\ Unite.app/Contents/MacOS/Intel\ Unite -removeaudiodriver
fi</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash

#Install the ACE "Audio Components" driver
/Applications/Intel\ Unite.app/Contents/MacOS/Intel\ Unite -installaudiodriver</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.1</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.IntelUnite</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
