<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest free version of NaturalReader and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.munki.NaturalReaderFree</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>NaturalReaderFree</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>NaturalReader 14 for Mac is a text-to-speech software for Mac and it uses excellent Natural Voices to convert any text into spoken words. It can also convert any written text into audio files for your CD player or iPod.&lt;br&gt;
&lt;ul&gt;
	&lt;li&gt;All basic text to speech functions&lt;/li&gt;
	&lt;li&gt;Free to download and free to use.&lt;/li&gt;
	&lt;li&gt;Compatible with PDF, Word, webpages&lt;/li&gt;
	&lt;li&gt;Floating bar&lt;/li&gt;
	&lt;li&gt;Change speaker and speed&lt;/li&gt;
	&lt;li&gt;Can read aloud any text.&lt;/li&gt;
	&lt;li&gt;Can adjust speed and change voice.&lt;/li&gt;
	&lt;li&gt;Comes with a floating bar to read any text in other applications.&lt;/li&gt;
&lt;/ul&gt;
</string>
			<key>developer</key>
			<string>NaturalSoft</string>
			<key>display_name</key>
			<string>NaturalReader Free</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>Productivity</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.NaturalReaderFree</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
