<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Weka.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.Weka</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Weka</string>
		<key>DOWNLOAD_URL</key>
		<string>https://sourceforge.net/projects/weka/files/latest/download</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>request_headers</key>
				<dict>
						<key>user-agent</key>
						<string>%USER_AGENT%</string>
				</dict>
				<key>re_pattern</key>
				<string>url=([^"]+)"</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
