<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Cisco AMP for Endpoints and imports it into Munki.

DOWNLOAD_URL can be found at https://console.amp.cisco.com/download_connector</string>
	<key>Identifier</key>
	<string>com.github.n8felton.munki.CiscoAMP</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>REPLACE_ME</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Cisco/AMP</string>
		<key>NAME</key>
		<string>Cisco AMP</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>Cisco AMP for Endpoints provides complete protection against the most advanced attacks. Not only will AMP prevent breaches and block malware at the point of entry, but it will also rapidly detect, contain, and remediate advanced threats if they evade front-line defenses and get inside.</string>
			<key>developer</key>
			<string>Cisco</string>
			<key>display_name</key>
			<string>Cisco AMP for Endpoints</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.CiscoAMP</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
