<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Apple provided Infotec Printer Drivers and imports them into Munki.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.munki.AppleInfotecPrinterDrivers</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Printers/Drivers</string>
		<key>MUNKI_CATEGORY</key>
		<string>Drivers</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Provides the latest Infotec printing and scanning software for OS X.</string>
			<key>display_name</key>
			<string>Infotec Printer Drivers</string>
			<key>maximum_os_version</key>
			<string>10.99</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.AppleInfotecPrinterDrivers</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Apple no longer supports these printer drivers for macOS Big Sur 11 and newer. You may wish to remove this recipe from your list.</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
