<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Apple provided FujiXerox Printer Drivers.</string>
    <key>Identifier</key>
    <string>com.github.n8felton.download.FujiXeroxPrinterDrivers</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FujiXeroxPrinterDrivers</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.n8felton.shared/AppleSupportDownloadInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>ARTICLE_NUMBER</key>
                <string>1776</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
