<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Apple provided Lanier Printer Drivers.</string>
    <key>Identifier</key>
    <string>com.github.n8felton.download.AppleLanierPrinterDrivers</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AppleLanierPrinterDrivers</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.n8felton.shared/AppleSupportDownloadInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>ARTICLE_NUMBER</key>
                <string>1865</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%pathname%/*PrinterDrivers.pkg</string>
            <key>expected_authority_names</key>
            <array>
              <string>Software Update</string>
              <string>Apple Software Update Certification Authority</string>
              <string>Apple Root CA</string>
            </array>
          </dict>
        </dict>
    </array>
</dict>
</plist>
