<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Meta Spark Studio and creates a package. Formally known as Spark AR Studio.</string>
    <key>Identifier</key>
    <string>com.github.n8felton.pkg.MetaSparkStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MetaSparkStudio</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.n8felton.download.MetaSparkStudio</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
