<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Graphviz.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.Graphviz</string>
	<key>Input</key>
	<dict>
		<key>GITLAB_HOSTNAME</key>
		<string>gitlab.com</string>
		<key>GITLAB_PROJECT_ID</key>
		<string>4207231</string>
		<key>NAME</key>
		<string>Graphviz</string>
		<key>latest</key>
		<string>true</string>
		<key>link_regex</key>
		<string>^Darwin_.*-arm64\.pkg$</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>GITLAB_HOSTNAME</key>
				<string>%GITLAB_HOSTNAME%</string>
				<key>GITLAB_PROJECT_ID</key>
				<string>%GITLAB_PROJECT_ID%</string>
				<key>latest</key>
				<string>%latest%</string>
				<key>link_regex</key>
				<string>%link_regex%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/GitLabReleasesInfoProvider</string>
		</dict>
		<!-- Commented out because version 14.1.2 does not have SHA256 files available.
			 Uncomment if future releases include .pkg.sha256 files again.
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.pkg.sha256</string>
				<key>url</key>
				<string>%direct_asset_url%.sha256</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		-->
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.pkg</string>
				<key>url</key>
				<string>%direct_asset_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<!-- Commented out because version 14.1.2 does not have SHA256 files available.
			 Uncomment if future releases include .pkg.sha256 files again.
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pathname</key>
				<string>%pathname%</string>
				<key>sha256checksumpath</key>
				<string>%pathname%.sha256</string>
			</dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/SHA256Checksum</string>
		</dict>
		-->
		<!-- Commented out because Graphviz packages are not code signed.
			 Uncomment if future releases are properly signed.
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Graphviz Project (96CU6RDK3D)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		-->
	</array>
</dict>
</plist>
