<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Graphviz.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.Graphviz</string>
	<key>Input</key>
	<dict>
		<key>GITLAB_HOSTNAME</key>
		<string>gitlab.com</string>
		<key>GITLAB_PROJECT_ID</key>
		<string>4207231</string>
		<key>NAME</key>
		<string>Graphviz</string>
		<key>latest</key>
		<string>true</string>
		<key>link_regex</key>
		<string>^Darwin_.*-arm64\.pkg$</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>GITLAB_HOSTNAME</key>
				<string>%GITLAB_HOSTNAME%</string>
				<key>GITLAB_PROJECT_ID</key>
				<string>%GITLAB_PROJECT_ID%</string>
				<key>latest</key>
				<string>%latest%</string>
				<key>link_regex</key>
				<string>%link_regex%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/GitLabReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.pkg.sha256</string>
				<key>url</key>
				<string>%direct_asset_url%.sha256</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.pkg</string>
				<key>url</key>
				<string>%direct_asset_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pathname</key>
				<string>%pathname%</string>
				<key>sha256checksumpath</key>
				<string>%pathname%.sha256</string>
			</dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/SHA256Checksum</string>
		</dict>
	</array>
</dict>
</plist>
