<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GraphViz and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.munki.GraphViz</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>GraphViz</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>GraphViz (short for Graph Visualization Software) is a package of open-source tools initiated by AT&amp;T Labs Research for drawing graphs specified in DOT language scripts. It also provides libraries for software applications to use the tools. GraphViz is free software licensed under the Eclipse Public License.</string>
			<key>developer</key>
			<string>AT&amp;T Labs Research</string>
			<key>display_name</key>
			<string>GraphViz</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>Math &amp; Science</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.GraphViz</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
