<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for VisualParadigmCE.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.visualparadigmce.download</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VisualParadigmCE</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.visual-paradigm.com/download/community.jsp?platform=macosx&amp;arch=jre</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>re_pattern</key>
				<string>href=&quot;(?P&lt;download&gt;.*dmg)&quot;</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.visual-paradigm.com%match%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Visual Paradigm.app</string>
				<key>requirement</key>
				<string>always</string>
			</dict>
		</dict>
	</array>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
</dict>
</plist>
