<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string></string>
	<key>Description</key>
	<string>Downloads the latest version of VMware AirWatch Admin Assistant and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.munki.VMwareAirWatchAdminAssistant</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/VMware</string>
		<key>NAME</key>
		<string>VMwareAirWatchAdminAssistant</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>VMware AirWatch Admin Assistant.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>The VMware Admin Assistant tool uses a Munki command-line utility to give admins an easy way to create the pkginfo metadata files that you must enforce software management.</string>
			<key>developer</key>
			<string>VMware</string>
			<key>display_name</key>
			<string>VMware AirWatch Admin Assistant</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.VMwareAirWatchAdminAssistant</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
