<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Chimera.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.Chimera</string>
	<key>Input</key>
	<dict>
		<key>BASE_URL</key>
		<string>https://www.cgl.ucsf.edu/chimera</string>
		<key>DOWNLOAD_URL</key>
		<string>%BASE_URL%/cgi-bin/secure/chimera-get.py?file=mac64</string>
		<key>NAME</key>
		<string>Chimera</string>
		<key>RE_PATTERN</key>
		<string>(?P&lt;file&gt;chimera-(?P&lt;version&gt;[^-]+)-mac64.dmg)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%BASE_URL%/download.html</string>
				<key>re_pattern</key>
				<string>%RE_PATTERN%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%/%file%&amp;choice=Accept</string>
				<key>re_pattern</key>
				<string>url=\/chimera\/(?P&lt;match&gt;[^"]+)"</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%BASE_URL%/%match%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>requirement</key>
				<string>identifier "edu.ucsf.cgl.chimera" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = F3YYBXAFJ8</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
