<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of CellProfiler and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.cellprofiler.munki</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.cellprofiler.download</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/CellProfiler</string>
		<key>NAME</key>
		<string>CellProfiler</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>CellProfiler is free, open-source software for quantitative analysis of biological images.</string>
			<key>display_name</key>
			<string>CellProfiler</string>
			<key>minimum_os_version</key>
			<string>10.6.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>Math &amp; Science</string>
			<key>developer</key>
			<string>CellProfiler</string>
			<key>requires</key>
			<array>
				<string>OracleJava8JDK</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
</dict>
</plist>
