<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Apple provided version of Java 6 for OS X as configured in com.github.n8felton.download.AppleJava6</string>
    <key>Identifier</key>
    <string>com.github.n8felton.munki.AppleJava6</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>plugins/Java</string>
        <key>MUNKI_CATEGORY</key>
        <string>Plugins</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Installs the legacy Java 6 runtime for OS X 10.7 - 10.11.</string>
            <key>display_name</key>
            <string>Java 6 for OS X</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
			<key>minimum_os_version</key>
            <string>10.7.0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.n8felton.download.AppleJava6</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>		
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
