<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest version of SPAdes.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.pkg.spades</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SPAdes</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.spades</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkgdirs</key>
				<dict>
					<key>etc/paths.d</key>
					<string>0755</string>
					<key>usr</key>
					<string>0755</string>
					<key>usr/local</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/*/</string>
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/spades-%version%</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Symlinker</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>/usr/local/spades-%version%</string>
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/spades</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%pkgroot%/etc/paths.d/spades</string>
				<key>file_content</key>
				<string>/usr/local/spades/bin</string>
				<key>file_mode</key>
				<string>644</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%pkgroot%</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>id</key>
					<string>ru.spbu.cab.spades</string>
					<key>version</key>
					<string>%version%</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0755</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
