<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Converts the Stanford CoreNLP download into a pkg.</string>
		<key>Identifier</key>
		<string>com.github.n8felton.pkg.CoreNLP</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>CoreNLP</string>
			<key>PKG_ID</key>
			<string>edu.stanford.nlp</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.3.1</string>
		<key>ParentRecipe</key>
		<string>com.github.n8felton.download.CoreNLP</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/payload</string>
					<key>pkgdirs</key>
					<dict>
						<key>usr</key>
						<string>0755</string>
						<key>usr/local</key>
						<string>0755</string>
						<key>etc</key>
						<string>0755</string>
						<key>etc/paths.d</key>
						<string>0755</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.zip</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Source</string>
					<key>purge_destination</key>
					<false/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileFinder</string>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Source/stanford-corenlp*</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileMover</string>
				<key>Arguments</key>
				<dict>
					<key>source</key>
					<string>%found_filename%</string>
					<key>target</key>
					<string>%pkgroot%/usr/local/corenlp</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Symlinker</string>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>/usr/local/corenlp/corenlp.sh</string>
					<key>destination_path</key>
					<string>%pkgroot%/usr/local/corenlp/corenlp</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
					<key>file_path</key>
					<string>%pkgroot%/etc/paths.d/corenlp</string>
					<key>file_mode</key>
					<string>0755</string>
					<key>file_content</key>
					<string>/usr/local/corenlp
					</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>pkgroot</key>
						<string>%pkgroot%</string>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
						<key>pkgname</key>
						<string>%NAME%-%version%</string>
						<key>id</key>
						<string>%PKG_ID%</string>
						<key>version</key>
						<string>%version%</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>chown</key>
						<array>
							<dict>
								<key>path</key>
								<string>usr/local/corenlp</string>
								<key>user</key>
								<string>root</string>
								<key>group</key>
								<string>wheel</string>
							</dict>
							<dict>
								<key>path</key>
								<string>etc/paths.d/corenlp</string>
								<key>user</key>
								<string>root</string>
								<key>group</key>
								<string>wheel</string>
							</dict>
						</array>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
