<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download recipe for Stanford's CoreNLP.</string>
		<key>Identifier</key>
		<string>com.github.n8felton.download.CoreNLP</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>CoreNLP</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.3.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://stanfordnlp.github.io/CoreNLP/download.html</string>
					<key>re_pattern</key>
					<string>(?P&lt;url&gt;[^"]+zip)"&gt;Download CoreNLP (?P&lt;version&gt;[^&lt; ]+)</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
					<key>filename</key>
					<string>%NAME%-%version%.zip</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
