<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest release of Mesquite from Github releases.</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.Mesquite</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mesquite</string>
		<key>PRERELEASES</key>
		<string>True</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>include_prereleases</key>
				<string>%PRERELEASES%</string>
				<key>github_repo</key>
				<string>MesquiteProject/MesquiteCore</string>
				<key>asset_regex</key>
				<string>(Mesquite.*(?=higher).*)</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict/>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Mesquite_Folder/Mesquite.app</string>
				<key>requirement</key>
				<string>identifier "start.Mesquite" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8LT29UFQPL"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
