<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Apache Ant binaries</string>
	<key>Identifier</key>
	<string>com.github.n8felton.download.Ant</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://mirrors.ocf.berkeley.edu/apache/ant/binaries</string>
		<key>NAME</key>
		<string>Ant</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;filename&gt;apache-ant-(?P&lt;version&gt;.+?)-bin.tar.bz2)</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%/?V=1;O=D</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%filename%</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%/%filename%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
