<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages a the latest version of Apache Maven</string>
	<key>Identifier</key>
	<string>com.github.n8felton.pkg.Maven</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Maven</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.Maven</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict>
					<key>Library</key>
					<string>0775</string>
					<key>etc</key>
					<string>0775</string>
					<key>etc/paths.d</key>
					<string>0775</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchived</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/unarchived/apache-maven-%version%</string>
				<key>target</key>
				<string>%pkgroot%/Library/Maven3</string>
			</dict>
		</dict>
		<!-- Add paths.d entry to make commands available in shells -->
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%pkgroot%/etc/paths.d/maven</string>
				<key>file_content</key>
				<string>/Library/Maven3/bin</string>
				<key>file_mode</key>
				<string>0755</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>version</key>
					<string>%version%</string>
					<key>id</key>
					<string>org.apache.maven3</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
						<dict>
							<key>path</key>
							<string>Library/Maven3</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0775</string>
						</dict>
						<dict>
							<key>path</key>
							<string>etc/paths.d/maven</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0644</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
