<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for ParaView.

Valid values for ARCH include:
- "x86_64" (default, Intel)
- "arm64" (Apple Silicon)
</string>
	<key>Identifier</key>
	<string>com.github.n8felton.paraview.download</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ParaView</string>
		<key>ARCH</key>
		<string>x86_64</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.paraview.org/files/?C=N;O=D</string>
				<key>re_pattern</key>
				<string>(?P&lt;folder&gt;v\d\.\d+)\/</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.paraview.org/files/%folder%/?C=N;O=D</string>
				<key>re_pattern</key>
				<string>"(?P&lt;file&gt;ParaView-[\d\.]+-MPI-OSX[\d\.]+-Python[\d\.]+-%ARCH%.dmg)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.paraview.org/files/%folder%/%file%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/ParaView*.app</string>
				<key>requirement</key>
				<string>identifier "org.paraview.ParaView" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = W38PE5Y733</string>
			</dict>
		</dict>
	</array>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
</dict>
</plist>
